UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a_features.h
/*
 * Copyright 2023 MindMotion Microelectronics Co., Ltd.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __MM32G0001A_FEATURES_H__
#define __MM32G0001A_FEATURES_H__

#include "mm32g0001a.h"

/*!
 * @addtogroup TIM_Peripheral_Access_Layer TIM Peripheral Access Layer
 *  @{
 */

/*******************************************************************************
 * TIM Type
 ******************************************************************************/
typedef struct {
    __IO uint32_t CR1;                                                            ///< Control register 1                           offset: 0x00
    __IO uint32_t CR2;                                                            ///< Control register 2                           offset: 0x04
    __IO uint32_t SMCR;                                                           ///< Slave mode control register                  offset: 0x08
    __IO uint32_t DIER;                                                           ///< DMA/interrupt enable register                offset: 0x0C
    __IO uint32_t SR;                                                             ///< Status register                              offset: 0x10
    __IO uint32_t EGR;                                                            ///< Event generation register                    offset: 0x14
    __IO uint32_t CCMR1;                                                          ///< Capture/compare mode register 1              offset: 0x18
    __IO uint32_t CCMR2;                                                          ///< Capture/compare enable register 2            offset: 0x1C
    __IO uint32_t CCER;                                                           ///< Capture/compare enable register              offset: 0x20
    __IO uint32_t CNT;                                                            ///< counter                                      offset: 0x24
    __IO uint32_t PSC;                                                            ///< Prescaler                                    offset: 0x28
    __IO uint32_t ARR;                                                            ///< Autoload register                            offset: 0x2C
    __IO uint32_t RCR;                                                            ///< Repeat count register                        offset: 0x30
    __IO uint32_t CCR[4];                                                         ///< Capture/compare register                     offset: 0x34
    __IO uint32_t BDTR;                                                           ///< Brake and dead zone registers                offset: 0x44
    __IO uint32_t DCR;                                                            ///< DMA control register                         offset: 0x48
    __IO uint32_t DMAR;                                                           ///< DMA address in continuous mode               offset: 0x4C
    __IO uint32_t Reserved11[1];                                                  ///< Reserved
    __IO uint32_t CCMR3;                                                          ///< Capture/compare mode register 3              offset: 0x54
    __IO uint32_t CCR5;                                                           ///< Capture/compare register 5                   offset: 0x58
    __IO uint32_t PDER;                                                           ///< PWM phase shift/DMA repeat update request enable registeroffset: 0x5C
    __IO uint32_t CCRFALL[5];                                                     ///< PWM phase shift down counting capture/compare registeroffset: 0x60
    __IO uint32_t BKINF;                                                          ///< brake input filter register                  offset: 0x74
} TIM_Type;

/*******************************************************************************
 * TIM Type
 ******************************************************************************/

/*!
 * @addtogroup TIM_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_CR1 Register Bit Definition
 */

#define TIM_CR1_CKD_SHIFT                      (8)
#define TIM_CR1_CKD_MASK                       (0x3U << TIM_CR1_CKD_SHIFT)
#define TIM_CR1_CKD(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_CKD_SHIFT)) & TIM_CR1_CKD_MASK)

#define TIM_CR1_ARPE_SHIFT                     (7)
#define TIM_CR1_ARPE_MASK                      (0x01U << TIM_CR1_ARPE_SHIFT)
#define TIM_CR1_ARPE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR1_ARPE_SHIFT)) & TIM_CR1_ARPE_MASK)

#define TIM_CR1_CMS_SHIFT                      (5)
#define TIM_CR1_CMS_MASK                       (0x3U << TIM_CR1_CMS_SHIFT)
#define TIM_CR1_CMS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_CMS_SHIFT)) & TIM_CR1_CMS_MASK)

#define TIM_CR1_DIR_SHIFT                      (4)
#define TIM_CR1_DIR_MASK                       (0x01U << TIM_CR1_DIR_SHIFT)
#define TIM_CR1_DIR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_DIR_SHIFT)) & TIM_CR1_DIR_MASK)

#define TIM_CR1_OPM_SHIFT                      (3)
#define TIM_CR1_OPM_MASK                       (0x01U << TIM_CR1_OPM_SHIFT)
#define TIM_CR1_OPM(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_OPM_SHIFT)) & TIM_CR1_OPM_MASK)

#define TIM_CR1_URS_SHIFT                      (2)
#define TIM_CR1_URS_MASK                       (0x01U << TIM_CR1_URS_SHIFT)
#define TIM_CR1_URS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_URS_SHIFT)) & TIM_CR1_URS_MASK)

#define TIM_CR1_UDIS_SHIFT                     (1)
#define TIM_CR1_UDIS_MASK                      (0x01U << TIM_CR1_UDIS_SHIFT)
#define TIM_CR1_UDIS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR1_UDIS_SHIFT)) & TIM_CR1_UDIS_MASK)

#define TIM_CR1_CEN_SHIFT                      (0)
#define TIM_CR1_CEN_MASK                       (0x01U << TIM_CR1_CEN_SHIFT)
#define TIM_CR1_CEN(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR1_CEN_SHIFT)) & TIM_CR1_CEN_MASK)

/*!
 * @brief TIM_CR2 Register Bit Definition
 */

#define TIM_CR2_OIS15_SHIFT                    (16)
#define TIM_CR2_OIS15_MASK                     (0x01U << TIM_CR2_OIS15_SHIFT)
#define TIM_CR2_OIS15(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS15_SHIFT)) & TIM_CR2_OIS15_MASK)

#define TIM_CR2_OIS4_SHIFT                     (14)
#define TIM_CR2_OIS4_MASK                      (0x01U << TIM_CR2_OIS4_SHIFT)
#define TIM_CR2_OIS4(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS4_SHIFT)) & TIM_CR2_OIS4_MASK)

#define TIM_CR2_OIS3N_SHIFT                    (13)
#define TIM_CR2_OIS3N_MASK                     (0x01U << TIM_CR2_OIS3N_SHIFT)
#define TIM_CR2_OIS3N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS3N_SHIFT)) & TIM_CR2_OIS3N_MASK)

#define TIM_CR2_OIS3_SHIFT                     (12)
#define TIM_CR2_OIS3_MASK                      (0x01U << TIM_CR2_OIS3_SHIFT)
#define TIM_CR2_OIS3(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS3_SHIFT)) & TIM_CR2_OIS3_MASK)

#define TIM_CR2_OIS2N_SHIFT                    (11)
#define TIM_CR2_OIS2N_MASK                     (0x01U << TIM_CR2_OIS2N_SHIFT)
#define TIM_CR2_OIS2N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS2N_SHIFT)) & TIM_CR2_OIS2N_MASK)

#define TIM_CR2_OIS2_SHIFT                     (10)
#define TIM_CR2_OIS2_MASK                      (0x01U << TIM_CR2_OIS2_SHIFT)
#define TIM_CR2_OIS2(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS2_SHIFT)) & TIM_CR2_OIS2_MASK)

#define TIM_CR2_OIS1N_SHIFT                    (9)
#define TIM_CR2_OIS1N_MASK                     (0x01U << TIM_CR2_OIS1N_SHIFT)
#define TIM_CR2_OIS1N(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS1N_SHIFT)) & TIM_CR2_OIS1N_MASK)

#define TIM_CR2_OIS1_SHIFT                     (8)
#define TIM_CR2_OIS1_MASK                      (0x01U << TIM_CR2_OIS1_SHIFT)
#define TIM_CR2_OIS1(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_OIS1_SHIFT)) & TIM_CR2_OIS1_MASK)

