UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a_features.h
#define TIM_CR2_TI1S_SHIFT                     (7)
#define TIM_CR2_TI1S_MASK                      (0x01U << TIM_CR2_TI1S_SHIFT)
#define TIM_CR2_TI1S(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_TI1S_SHIFT)) & TIM_CR2_TI1S_MASK)

#define TIM_CR2_MMS_SHIFT                      (4)
#define TIM_CR2_MMS_MASK                       (0x7U << TIM_CR2_MMS_SHIFT)
#define TIM_CR2_MMS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CR2_MMS_SHIFT)) & TIM_CR2_MMS_MASK)

#define TIM_CR2_CCDS_SHIFT                     (3)
#define TIM_CR2_CCDS_MASK                      (0x01U << TIM_CR2_CCDS_SHIFT)
#define TIM_CR2_CCDS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_CCDS_SHIFT)) & TIM_CR2_CCDS_MASK)

#define TIM_CR2_CCUS_SHIFT                     (2)
#define TIM_CR2_CCUS_MASK                      (0x01U << TIM_CR2_CCUS_SHIFT)
#define TIM_CR2_CCUS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_CCUS_SHIFT)) & TIM_CR2_CCUS_MASK)

#define TIM_CR2_CCPC_SHIFT                     (0)
#define TIM_CR2_CCPC_MASK                      (0x01U << TIM_CR2_CCPC_SHIFT)
#define TIM_CR2_CCPC(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_CR2_CCPC_SHIFT)) & TIM_CR2_CCPC_MASK)

/*!
 * @brief TIM_SMCR Register Bit Definition
 */

#define TIM_SMCR_ETP_SHIFT                     (15)
#define TIM_SMCR_ETP_MASK                      (0x01U << TIM_SMCR_ETP_SHIFT)
#define TIM_SMCR_ETP(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ETP_SHIFT)) & TIM_SMCR_ETP_MASK)

#define TIM_SMCR_ECE_SHIFT                     (14)
#define TIM_SMCR_ECE_MASK                      (0x01U << TIM_SMCR_ECE_SHIFT)
#define TIM_SMCR_ECE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ECE_SHIFT)) & TIM_SMCR_ECE_MASK)

#define TIM_SMCR_ETPS_SHIFT                    (12)
#define TIM_SMCR_ETPS_MASK                     (0x3U << TIM_SMCR_ETPS_SHIFT)
#define TIM_SMCR_ETPS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ETPS_SHIFT)) & TIM_SMCR_ETPS_MASK)

#define TIM_SMCR_ETF_SHIFT                     (8)
#define TIM_SMCR_ETF_MASK                      (0xFU << TIM_SMCR_ETF_SHIFT)
#define TIM_SMCR_ETF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_ETF_SHIFT)) & TIM_SMCR_ETF_MASK)

#define TIM_SMCR_MSM_SHIFT                     (7)
#define TIM_SMCR_MSM_MASK                      (0x01U << TIM_SMCR_MSM_SHIFT)
#define TIM_SMCR_MSM(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_MSM_SHIFT)) & TIM_SMCR_MSM_MASK)

#define TIM_SMCR_TS_SHIFT                      (4)
#define TIM_SMCR_TS_MASK                       (0x7U << TIM_SMCR_TS_SHIFT)
#define TIM_SMCR_TS(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_TS_SHIFT)) & TIM_SMCR_TS_MASK)

#define TIM_SMCR_OCCS_SHIFT                    (3)
#define TIM_SMCR_OCCS_MASK                     (0x01U << TIM_SMCR_OCCS_SHIFT)
#define TIM_SMCR_OCCS(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_OCCS_SHIFT)) & TIM_SMCR_OCCS_MASK)

#define TIM_SMCR_SMS_SHIFT                     (0)
#define TIM_SMCR_SMS_MASK                      (0x7U << TIM_SMCR_SMS_SHIFT)
#define TIM_SMCR_SMS(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SMCR_SMS_SHIFT)) & TIM_SMCR_SMS_MASK)

/*!
 * @brief TIM_DIER Register Bit Definition
 */

#define TIM_DIER_CC5DE_SHIFT                   (17)
#define TIM_DIER_CC5DE_MASK                    (0x01U << TIM_DIER_CC5DE_SHIFT)
#define TIM_DIER_CC5DE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC5DE_SHIFT)) & TIM_DIER_CC5DE_MASK)

#define TIM_DIER_CC5IE_SHIFT                   (16)
#define TIM_DIER_CC5IE_MASK                    (0x01U << TIM_DIER_CC5IE_SHIFT)
#define TIM_DIER_CC5IE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC5IE_SHIFT)) & TIM_DIER_CC5IE_MASK)

#define TIM_DIER_TDE_SHIFT                     (14)
#define TIM_DIER_TDE_MASK                      (0x01U << TIM_DIER_TDE_SHIFT)
#define TIM_DIER_TDE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_DIER_TDE_SHIFT)) & TIM_DIER_TDE_MASK)

#define TIM_DIER_COMDE_SHIFT                   (13)
#define TIM_DIER_COMDE_MASK                    (0x01U << TIM_DIER_COMDE_SHIFT)
#define TIM_DIER_COMDE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_COMDE_SHIFT)) & TIM_DIER_COMDE_MASK)

#define TIM_DIER_CC4DE_SHIFT                   (12)
#define TIM_DIER_CC4DE_MASK                    (0x01U << TIM_DIER_CC4DE_SHIFT)
#define TIM_DIER_CC4DE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC4DE_SHIFT)) & TIM_DIER_CC4DE_MASK)

#define TIM_DIER_CC3DE_SHIFT                   (11)
#define TIM_DIER_CC3DE_MASK                    (0x01U << TIM_DIER_CC3DE_SHIFT)
#define TIM_DIER_CC3DE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC3DE_SHIFT)) & TIM_DIER_CC3DE_MASK)

#define TIM_DIER_CC2DE_SHIFT                   (10)
#define TIM_DIER_CC2DE_MASK                    (0x01U << TIM_DIER_CC2DE_SHIFT)
#define TIM_DIER_CC2DE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC2DE_SHIFT)) & TIM_DIER_CC2DE_MASK)

#define TIM_DIER_CC1DE_SHIFT                   (9)
#define TIM_DIER_CC1DE_MASK                    (0x01U << TIM_DIER_CC1DE_SHIFT)
#define TIM_DIER_CC1DE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC1DE_SHIFT)) & TIM_DIER_CC1DE_MASK)

#define TIM_DIER_UDE_SHIFT                     (8)
#define TIM_DIER_UDE_MASK                      (0x01U << TIM_DIER_UDE_SHIFT)
#define TIM_DIER_UDE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_DIER_UDE_SHIFT)) & TIM_DIER_UDE_MASK)

#define TIM_DIER_BIE_SHIFT                     (7)
#define TIM_DIER_BIE_MASK                      (0x01U << TIM_DIER_BIE_SHIFT)
#define TIM_DIER_BIE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_DIER_BIE_SHIFT)) & TIM_DIER_BIE_MASK)

#define TIM_DIER_TIE_SHIFT                     (6)
#define TIM_DIER_TIE_MASK                      (0x01U << TIM_DIER_TIE_SHIFT)
#define TIM_DIER_TIE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_DIER_TIE_SHIFT)) & TIM_DIER_TIE_MASK)

#define TIM_DIER_COMIE_SHIFT                   (5)
#define TIM_DIER_COMIE_MASK                    (0x01U << TIM_DIER_COMIE_SHIFT)
#define TIM_DIER_COMIE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_COMIE_SHIFT)) & TIM_DIER_COMIE_MASK)

#define TIM_DIER_CC4IE_SHIFT                   (4)
#define TIM_DIER_CC4IE_MASK                    (0x01U << TIM_DIER_CC4IE_SHIFT)
#define TIM_DIER_CC4IE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC4IE_SHIFT)) & TIM_DIER_CC4IE_MASK)

#define TIM_DIER_CC3IE_SHIFT                   (3)
#define TIM_DIER_CC3IE_MASK                    (0x01U << TIM_DIER_CC3IE_SHIFT)
#define TIM_DIER_CC3IE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC3IE_SHIFT)) & TIM_DIER_CC3IE_MASK)

#define TIM_DIER_CC2IE_SHIFT                   (2)
#define TIM_DIER_CC2IE_MASK                    (0x01U << TIM_DIER_CC2IE_SHIFT)
#define TIM_DIER_CC2IE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC2IE_SHIFT)) & TIM_DIER_CC2IE_MASK)

#define TIM_DIER_CC1IE_SHIFT                   (1)
#define TIM_DIER_CC1IE_MASK                    (0x01U << TIM_DIER_CC1IE_SHIFT)
#define TIM_DIER_CC1IE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_DIER_CC1IE_SHIFT)) & TIM_DIER_CC1IE_MASK)

