UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a_features.h
#define TIM_DIER_UIE_SHIFT                     (0)
#define TIM_DIER_UIE_MASK                      (0x01U << TIM_DIER_UIE_SHIFT)
#define TIM_DIER_UIE(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_DIER_UIE_SHIFT)) & TIM_DIER_UIE_MASK)

/*!
 * @brief TIM_SR Register Bit Definition
 */

#define TIM_SR_CC5IF_SHIFT                     (16)
#define TIM_SR_CC5IF_MASK                      (0x01U << TIM_SR_CC5IF_SHIFT)
#define TIM_SR_CC5IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC5IF_SHIFT)) & TIM_SR_CC5IF_MASK)

#define TIM_SR_CC4OF_SHIFT                     (12)
#define TIM_SR_CC4OF_MASK                      (0x01U << TIM_SR_CC4OF_SHIFT)
#define TIM_SR_CC4OF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC4OF_SHIFT)) & TIM_SR_CC4OF_MASK)

#define TIM_SR_CC3OF_SHIFT                     (11)
#define TIM_SR_CC3OF_MASK                      (0x01U << TIM_SR_CC3OF_SHIFT)
#define TIM_SR_CC3OF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC3OF_SHIFT)) & TIM_SR_CC3OF_MASK)

#define TIM_SR_CC2OF_SHIFT                     (10)
#define TIM_SR_CC2OF_MASK                      (0x01U << TIM_SR_CC2OF_SHIFT)
#define TIM_SR_CC2OF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC2OF_SHIFT)) & TIM_SR_CC2OF_MASK)

#define TIM_SR_CC1OF_SHIFT                     (9)
#define TIM_SR_CC1OF_MASK                      (0x01U << TIM_SR_CC1OF_SHIFT)
#define TIM_SR_CC1OF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC1OF_SHIFT)) & TIM_SR_CC1OF_MASK)

#define TIM_SR_BIF_SHIFT                       (7)
#define TIM_SR_BIF_MASK                        (0x01U << TIM_SR_BIF_SHIFT)
#define TIM_SR_BIF(x)                          (((uint32_t)(((uint32_t)(x)) << TIM_SR_BIF_SHIFT)) & TIM_SR_BIF_MASK)

#define TIM_SR_TIF_SHIFT                       (6)
#define TIM_SR_TIF_MASK                        (0x01U << TIM_SR_TIF_SHIFT)
#define TIM_SR_TIF(x)                          (((uint32_t)(((uint32_t)(x)) << TIM_SR_TIF_SHIFT)) & TIM_SR_TIF_MASK)

#define TIM_SR_COMIF_SHIFT                     (5)
#define TIM_SR_COMIF_MASK                      (0x01U << TIM_SR_COMIF_SHIFT)
#define TIM_SR_COMIF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_COMIF_SHIFT)) & TIM_SR_COMIF_MASK)

#define TIM_SR_CC4IF_SHIFT                     (4)
#define TIM_SR_CC4IF_MASK                      (0x01U << TIM_SR_CC4IF_SHIFT)
#define TIM_SR_CC4IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC4IF_SHIFT)) & TIM_SR_CC4IF_MASK)

#define TIM_SR_CC3IF_SHIFT                     (3)
#define TIM_SR_CC3IF_MASK                      (0x01U << TIM_SR_CC3IF_SHIFT)
#define TIM_SR_CC3IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC3IF_SHIFT)) & TIM_SR_CC3IF_MASK)

#define TIM_SR_CC2IF_SHIFT                     (2)
#define TIM_SR_CC2IF_MASK                      (0x01U << TIM_SR_CC2IF_SHIFT)
#define TIM_SR_CC2IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC2IF_SHIFT)) & TIM_SR_CC2IF_MASK)

#define TIM_SR_CC1IF_SHIFT                     (1)
#define TIM_SR_CC1IF_MASK                      (0x01U << TIM_SR_CC1IF_SHIFT)
#define TIM_SR_CC1IF(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_SR_CC1IF_SHIFT)) & TIM_SR_CC1IF_MASK)

#define TIM_SR_UIF_SHIFT                       (0)
#define TIM_SR_UIF_MASK                        (0x01U << TIM_SR_UIF_SHIFT)
#define TIM_SR_UIF(x)                          (((uint32_t)(((uint32_t)(x)) << TIM_SR_UIF_SHIFT)) & TIM_SR_UIF_MASK)

/*!
 * @brief TIM_EGR Register Bit Definition
 */

#define TIM_EGR_CC5G_SHIFT                     (16)
#define TIM_EGR_CC5G_MASK                      (0x01U << TIM_EGR_CC5G_SHIFT)
#define TIM_EGR_CC5G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_EGR_CC5G_SHIFT)) & TIM_EGR_CC5G_MASK)

#define TIM_EGR_BG_SHIFT                       (7)
#define TIM_EGR_BG_MASK                        (0x01U << TIM_EGR_BG_SHIFT)
#define TIM_EGR_BG(x)                          (((uint32_t)(((uint32_t)(x)) << TIM_EGR_BG_SHIFT)) & TIM_EGR_BG_MASK)

#define TIM_EGR_TG_SHIFT                       (6)
#define TIM_EGR_TG_MASK                        (0x01U << TIM_EGR_TG_SHIFT)
#define TIM_EGR_TG(x)                          (((uint32_t)(((uint32_t)(x)) << TIM_EGR_TG_SHIFT)) & TIM_EGR_TG_MASK)

#define TIM_EGR_COMG_SHIFT                     (5)
#define TIM_EGR_COMG_MASK                      (0x01U << TIM_EGR_COMG_SHIFT)
#define TIM_EGR_COMG(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_EGR_COMG_SHIFT)) & TIM_EGR_COMG_MASK)

#define TIM_EGR_CC4G_SHIFT                     (4)
#define TIM_EGR_CC4G_MASK                      (0x01U << TIM_EGR_CC4G_SHIFT)
#define TIM_EGR_CC4G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_EGR_CC4G_SHIFT)) & TIM_EGR_CC4G_MASK)

#define TIM_EGR_CC3G_SHIFT                     (3)
#define TIM_EGR_CC3G_MASK                      (0x01U << TIM_EGR_CC3G_SHIFT)
#define TIM_EGR_CC3G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_EGR_CC3G_SHIFT)) & TIM_EGR_CC3G_MASK)

#define TIM_EGR_CC2G_SHIFT                     (2)
#define TIM_EGR_CC2G_MASK                      (0x01U << TIM_EGR_CC2G_SHIFT)
#define TIM_EGR_CC2G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_EGR_CC2G_SHIFT)) & TIM_EGR_CC2G_MASK)

#define TIM_EGR_CC1G_SHIFT                     (1)
#define TIM_EGR_CC1G_MASK                      (0x01U << TIM_EGR_CC1G_SHIFT)
#define TIM_EGR_CC1G(x)                        (((uint32_t)(((uint32_t)(x)) << TIM_EGR_CC1G_SHIFT)) & TIM_EGR_CC1G_MASK)

#define TIM_EGR_UG_SHIFT                       (0)
#define TIM_EGR_UG_MASK                        (0x01U << TIM_EGR_UG_SHIFT)
#define TIM_EGR_UG(x)                          (((uint32_t)(((uint32_t)(x)) << TIM_EGR_UG_SHIFT)) & TIM_EGR_UG_MASK)

/*!
 * @brief TIM_CCMR1 Register Bit Definition
 */

#define TIM_CCMR1_OC2CE_SHIFT                  (15)
#define TIM_CCMR1_OC2CE_MASK                   (0x01U << TIM_CCMR1_OC2CE_SHIFT)
#define TIM_CCMR1_OC2CE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_CCMR1_OC2CE_SHIFT)) & TIM_CCMR1_OC2CE_MASK)

#define TIM_CCMR1_OC2M_SHIFT                   (12)
#define TIM_CCMR1_OC2M_MASK                    (0x7U << TIM_CCMR1_OC2M_SHIFT)
#define TIM_CCMR1_OC2M(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCMR1_OC2M_SHIFT)) & TIM_CCMR1_OC2M_MASK)

#define TIM_CCMR1_OC2PE_SHIFT                  (11)
#define TIM_CCMR1_OC2PE_MASK                   (0x01U << TIM_CCMR1_OC2PE_SHIFT)
#define TIM_CCMR1_OC2PE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_CCMR1_OC2PE_SHIFT)) & TIM_CCMR1_OC2PE_MASK)

