UnsicentificLaLaLaLa/led-matrix/software/firmware/led-matrix_firmware/device/mm32g0001a_features.h
#define TIM_PDER_CCR5SHIFTEN_SHIFT             (5)
#define TIM_PDER_CCR5SHIFTEN_MASK              (0x01U << TIM_PDER_CCR5SHIFTEN_SHIFT)
#define TIM_PDER_CCR5SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR5SHIFTEN_SHIFT)) & TIM_PDER_CCR5SHIFTEN_MASK)

#define TIM_PDER_CCR4SHIFTEN_SHIFT             (4)
#define TIM_PDER_CCR4SHIFTEN_MASK              (0x01U << TIM_PDER_CCR4SHIFTEN_SHIFT)
#define TIM_PDER_CCR4SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR4SHIFTEN_SHIFT)) & TIM_PDER_CCR4SHIFTEN_MASK)

#define TIM_PDER_CCR3SHIFTEN_SHIFT             (3)
#define TIM_PDER_CCR3SHIFTEN_MASK              (0x01U << TIM_PDER_CCR3SHIFTEN_SHIFT)
#define TIM_PDER_CCR3SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR3SHIFTEN_SHIFT)) & TIM_PDER_CCR3SHIFTEN_MASK)

#define TIM_PDER_CCR2SHIFTEN_SHIFT             (2)
#define TIM_PDER_CCR2SHIFTEN_MASK              (0x01U << TIM_PDER_CCR2SHIFTEN_SHIFT)
#define TIM_PDER_CCR2SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR2SHIFTEN_SHIFT)) & TIM_PDER_CCR2SHIFTEN_MASK)

#define TIM_PDER_CCR1SHIFTEN_SHIFT             (1)
#define TIM_PDER_CCR1SHIFTEN_MASK              (0x01U << TIM_PDER_CCR1SHIFTEN_SHIFT)
#define TIM_PDER_CCR1SHIFTEN(x)                (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCR1SHIFTEN_SHIFT)) & TIM_PDER_CCR1SHIFTEN_MASK)

#define TIM_PDER_CCDREPE_SHIFT                 (0)
#define TIM_PDER_CCDREPE_MASK                  (0x01U << TIM_PDER_CCDREPE_SHIFT)
#define TIM_PDER_CCDREPE(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_PDER_CCDREPE_SHIFT)) & TIM_PDER_CCDREPE_MASK)

/*!
 * @brief TIM_CCRFALL Register Bit Definition
 */

#define TIM_CCRFALL_CCRFALL_SHIFT              (0)
#define TIM_CCRFALL_CCRFALL_MASK               (0xFFFFU << TIM_CCRFALL_CCRFALL_SHIFT)
#define TIM_CCRFALL_CCRFALL(x)                 (((uint32_t)(((uint32_t)(x)) << TIM_CCRFALL_CCRFALL_SHIFT)) & TIM_CCRFALL_CCRFALL_MASK)

/*!
 * @brief TIM_BKINF Register Bit Definition
 */

#define TIM_BKINF_BKINSEL_SHIFT                 (5)
#define TIM_BKINF_BKINSEL_MASK                  (0XFFFU << TIM_BKINF_BKINSEL_SHIFT)
#define TIM_BKINF_BKINSEL(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINSEL_SHIFT)) & TIM_BKINF_BKINSEL_MASK)

#define TIM_BKINF_BKINF_SHIFT                   (1)
#define TIM_BKINF_BKINF_MASK                    (0XFU << TIM_BKINF_BKINF_SHIFT)
#define TIM_BKINF_BKINF(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINF_SHIFT)) & TIM_BKINF_BKINF_MASK)

#define TIM_BKINF_BKINFE_SHIFT                  (0)
#define TIM_BKINF_BKINFE_MASK                   (0X01U << TIM_BKINF_BKINFE_SHIFT)
#define TIM_BKINF_BKINFE(x)                     (((uint32_t)(((uint32_t)(x)) << TIM_BKINF_BKINFE_SHIFT)) & TIM_BKINF_BKINFE_MASK)

/*!
 * @}
 */ /* end of group TIM_Register_Masks */

/*!
 * @brief ADC Register Bit Definition
 * these register definition not be used in mm32f0020
 */
#define ADC_ADCR_EOSIE_MASK                     ADC_ADCR_ADIE_MASK
#define ADC_ADSTA_EOSIF_MASK                    ADC_ADSTA_ADIF_MASK
#endif  /* __MM32G0001A_FEATURES_H__ */
